app/controllers/users_controller.rb

INSERT INTO "users" ("name", "email", "created_at", "updated_at", "password_digest", "activation_digest", "card_number", "team_name") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
    @user = User.new(user_params)
    if @user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "users" SET "characterfirstname" = $1, "characterlastname" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["characterfirstname", "DMB"], ["characterlastname", "Loyalty"], ["updated_at", "2017-12-31 17:27:13.937698"], ["id", 2]]
---
  def update
    @user = User.find(params[:id])
    if @user.update_attributes(user_params)